---
kind: property
id: P:Autodesk.Revit.DB.FabricationAncillaryUsage.ProductCode
source: html/9aa2c088-0a79-de27-022e-3e185c99f7bf.htm
---
# Autodesk.Revit.DB.FabricationAncillaryUsage.ProductCode Property

A unique string code that idnenifies the ancillary in the fabriction database in order to purchase it.

## Syntax (C#)
```csharp
public string ProductCode { get; }
```